docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-23 Sat 11:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hello. I'm Pankaj Jangid</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pankaj Jangid" />
</head>
<body>
<div id="content">
<h1 class="title">Hello. I'm Pankaj Jangid
<br />
<span class="subtitle">I read code. I write code.</span>
</h1>
<p>
This is my <i><b>own</b></i> space. Follow &#x2026; oops! &#x2026; bookmark this page and
check once in a while to see what is happening in my life. Sorry if I
sound like a self-obsessed person. But I don't have any other way to
protect <i>your</i> privacy. This is the only page where I can share my
whereabouts without you being tracked. Also this page is <i>usually</i>
more current than my <a href="https://twitter.com/codeisgreat">twitter</a> timeline. If you have any comments or got
a suggestion for me or you just want to say hello to me then write an
email at my.firstname@domain.of.this.web.site.
</p>

<div id="outline-container-org6c219c8" class="outline-2">
<h2 id="org6c219c8">New writeup <a href="writings.html">(full list</a>)</h2>
<div class="outline-text-2" id="text-org6c219c8">
<ul class="org-ul">
<li><p>
<a href="notes/emacs-macos-contacts.html">MacOS Contacts in Emacs</a>
</p>

<p>
I was browsing the <code>etc/NEWS</code> file from the latest emacs source code
and found this useful feature. Currently my work requires me to work
on macOS so this is kind of essential for me to fetch contacts into
<code>Gnus</code>. Because that is what I use for all my emails and news.
</p>

<p>
Now that it is a builtin feature, no need for any extra package for
email address management and autocompletion. My online contacts book
is connected to macOS contacts via <code>CardDav</code> and now <code>Emacs</code> is also
connected to that.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org089c520" class="outline-2">
<h2 id="org089c520">Recently read or currently reading (<a href="readings.html">full list</a>)</h2>
<div class="outline-text-2" id="text-org089c520">
<ul class="org-ul">
<li><p>
<a href="https://en.wikipedia.org/wiki/Main_Page">Wikipedia</a>
</p>

<p>
"Wikipedia is a proof that you can trust people, most of the time",
a friend of mine told me this once. This is a profound statement.
</p></li>

<li><p>
<a href="https://ai.googleblog.com/2020/10/background-features-in-google-meet.html">Background Features in Google Meet, Powered by Web ML</a>
</p>

<p>
Good thing is that it is based on an open-sourced project <a href="https://github.com/google/mediapipe">MediaPipe</a>
by Google. This uses WebAssembly to speedup in-browser
execution. And it looks like that Google is really into it. Google
is into everything BTW. They have released Chrome 84 that supports
WebAssembly <a href="https://en.wikipedia.org/wiki/SIMD">SIMD</a> as well, claiming 2x performance boost.
</p>

<p>
MobileNetV3 diagram is cool. The encoder and decoder are symmetric
in this network. The post shares some example gifs to give you an
idea. Honestly shares where it lacks. Look at the last gif. It
clearly shows edge problems. But this is will definitely improve
overtime. Great work.
</p></li>

<li><p>
<a href="https://turnerj.com/blog/a-better-mousetrap">A Better Mousetrap</a>
</p>

<p>
This is a nice write-up on product launch journey. So many people
think that it is a small thing to just try out and fail. No. Even if
you are building a small <i>thing</i>, it is going to take some time. It
is difficult to keep the hope alive. And the ones who do it, they
really make it <i>big</i>.
</p></li>

<li><p>
<a href="https://lwn.net/SubscriberLink/835599/f3b49b022582e03e/">Packaging Kubernetes for Debian</a>
</p>

<p>
This arcticle clarifies why you are not seeing and perhaps won't see
Kubernetes in any stable version of Debian in the near
future. Debian Technical Committee (TC) will have to either change
rules if they want it to bring into Debian Stable <i>or</i> they may just
keep Kubernetes in the Debian Testing repository, where they don't
have any hard commitment towards security.
</p></li>

<li><p>
<a href="https://tools.ietf.org/html/rfc6749">The OAuth 2.0 Authorization Framework</a>:
</p>

<p>
Working on a tiny hello-world kind-of appication for learning
something. But I don't want to re-implement authentication
part. This has been done a million times by so many programmers. So
I pulled a <a href="https://hub.docker.com/r/jboss/keycloak">Keycloak</a> image from the Docker Hub. And spawned it. Great
work indeed.
</p>

<p>
But how can I just sit and watch it work. As always. Lost in the
web. First <a href="https://www.keycloak.org/documentation">Keycloak docs</a> → <a href="https://openid.net/connect/">OpenID</a> → <a href="https://tools.ietf.org/html/rfc6749">OAuth</a>.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org663544f" class="outline-2">
<h2 id="org663544f">To Read</h2>
<div class="outline-text-2" id="text-org663544f">
<ul class="org-ul">
<li><a href="https://fasterthanli.me/series/making-our-own-executable-packer/part-1">What's in a Linux executable?</a></li>
<li><a href="https://openid.net/connect/">OpenID Connect</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pankaj Jangid (<a href="mailto:pankaj@codeisgreat.org">pankaj@codeisgreat.org</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.0.50 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
